tap "databricks/tap"
brew "libomp"
brew "armadillo"
brew "bat"
brew "bear"
brew "boost"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gsl"
brew "ifstat"
brew "jq"
brew "lazygit"
brew "llvm"
brew "mas"
brew "node"
brew "rainfrog"
brew "ripgrep"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "tmux"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "databricks/tap/databricks"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "karabiner-elements"
cask "rectangle-pro"
cask "sf-symbols"
cask "shortcat"
cask "warp"
cask "zoom"
mas "CleanMyMac", id: 1339170533
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
cargo "kanata"
